"""
numpy数组中冒号的使用(切片)
"""
import numpy as np


X= np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]])
print("------------全部选择--------------")
# X[:,0]就是取矩阵X的所有行的第0列的元素，X[:,1] 就是取所有行的第1列的元素
# [ 1  5  9 13 17]
print(X[:,0])
# [ 2  6 10 14 18]
print(X[:,1])

print("------指定范围---------")
# X[:, m:n]即取矩阵X的所有行中的的第m到n-1列数据，含左不含右
"""
[[ 3]
 [ 7]
 [11]
 [15]
 [19]]
"""
print(X[:,2:3])
"""
[[ 3  4]
 [ 7  8]
 [11 12]
 [15 16]
 [19 20]]
"""
print(X[:,2:4])

print("----------高阶用法--------------")
"""
使用方法[start: end : step ]--->[ 起始下标 : 终止下标 : 间隔距离 ]
切片范围是： start <= x < end,注意：一个小于等于，一个小于。
"""
"""
[[ 1  3]
 [ 5  7]
 [ 9 11]
 [13 15]
 [17 19]]
"""
print(X[:,0:3:2])

